ansgomez/batteryless-walking-speed-estimation/code/CCStudio/MSP432_CameraAcquisition_8bit/sd_diskio.c
/*-----------------------------------------------------------------------*/
/* MMC/SDC (in SPI mode) control module  (C)ChaN, 2007                   */
/*-----------------------------------------------------------------------*/
/* Only rcvr_spi(), xmit_spi(), disk_timerproc() and some macros         */
/* are platform dependent.                                               */
/*-----------------------------------------------------------------------*/

/*
 * This file was modified from a sample available from the FatFs
 * web site. It was modified to work with the MS432 Launchpad.
 * The DK-TM4C123G development board porting file from TI TivaWare was
 * used as an example.
 *
 * Author: Gerard Sequeira, bluehash@43oh
 *
 * EDIT: Thomas Schalch, 2016
 * many corrections such that code runs with every tested SD Card
 *
 */

/* DriverLib Includes */
#include "driverlib.h"

/* Standard Includes */
#include <stdint.h>
#include <stdbool.h>
#include <stdio.h>
#include <string.h>

#include "utils/diskio.h"
#include "sd_diskio.h"


void SysTick_ISR(void) {
	// Call the FatFs tick timer.
	disk_timerproc();
}


// A structure that holds a mapping between an FRESULT numerical code, and a
// string representation.  FRESULT codes are returned from the FatFs FAT file
// system driver.
typedef struct {
	FRESULT iFResult;
	char *pcResultStr;
} tFResultString;

// A macro to make it easy to add result codes to the table.
#define FRESULT_ENTRY(f)        { (f), (#f) }

// A table that holds a mapping between the numerical FRESULT code and it's
// name as a string.  This is used for looking up error codes for printing to
// the console.
tFResultString g_psFResultStrings[] = {
FRESULT_ENTRY(FR_OK),
FRESULT_ENTRY(FR_DISK_ERR),
FRESULT_ENTRY(FR_INT_ERR),
FRESULT_ENTRY(FR_NOT_READY),
FRESULT_ENTRY(FR_NO_FILE),
FRESULT_ENTRY(FR_NO_PATH),
FRESULT_ENTRY(FR_INVALID_NAME),
FRESULT_ENTRY(FR_DENIED),
FRESULT_ENTRY(FR_EXIST),
FRESULT_ENTRY(FR_INVALID_OBJECT),
FRESULT_ENTRY(FR_WRITE_PROTECTED),
FRESULT_ENTRY(FR_INVALID_DRIVE),
FRESULT_ENTRY(FR_NOT_ENABLED),
FRESULT_ENTRY(FR_NO_FILESYSTEM),
FRESULT_ENTRY(FR_MKFS_ABORTED),
FRESULT_ENTRY(FR_TIMEOUT),
FRESULT_ENTRY(FR_LOCKED),
FRESULT_ENTRY(FR_NOT_ENOUGH_CORE),
FRESULT_ENTRY(FR_TOO_MANY_OPEN_FILES),
FRESULT_ENTRY(FR_INVALID_PARAMETER), };

// A macro that holds the number of result codes.
#define NUM_FRESULT_CODES       (sizeof(g_psFResultStrings) /                 \
                                 sizeof(tFResultString))


// This function returns a string representation of an error code that was
// returned from a function call to FatFs.  It can be used for printing human
// readable error messages.
const char * StringFromFResult(FRESULT iFResult) {
	uint_fast8_t ui8Idx;

	// Enter a loop to search the error code table for a matching error code.
	for (ui8Idx = 0; ui8Idx < NUM_FRESULT_CODES; ui8Idx++) {
		// If a match is found, then return the string name of the error code.
		if (g_psFResultStrings[ui8Idx].iFResult == iFResult) {
			return (g_psFResultStrings[ui8Idx].pcResultStr);
		}
	}

	// At this point no matching code was found, so return a string indicating
	// an unknown error.
	return ("UNKNOWN ERROR CODE");
}


/*--------------------------------------------------------------------------

   Module Private Functions

---------------------------------------------------------------------------*/

static volatile
DSTATUS Stat = STA_NOINIT;    /* Disk status */

static volatile
BYTE Timer1, Timer2;    /* 100Hz decrement timer */

static
BYTE CardType;            /* b0:MMC, b1:SDC, b2:Block addressing */

static
BYTE PowerFlag = 0;     /* indicates if "power" is on */


static
void dly_us (UINT n)	/* Delay n microseconds */
{
	while (n) {
		__delay_cycles(48);
		n--;
	}
}


// set the SPI speed to the max setting
static
void set_max_speed(void)
{
	SPI_changeMasterClock(SD_SPI_BASE, CS_getSMCLK(), SD_SPI_MAX_FREQUENCY);
}

// set the SPI speed to the init setting
static
void set_init_speed(void)
{
	SPI_changeMasterClock(SD_SPI_BASE, CS_getSMCLK(), SD_SPI_FREQUENCY);
}

/*-----------------------------------------------------------------------*/
/* Transmit a byte to MMC via SPI  (Platform dependent)                  */
/*-----------------------------------------------------------------------*/

static
void xmit_spi(BYTE dat)
{
    BYTE RcvDat;

	// SPI_clearInterruptFlag
    EUSCI_B_CMSIS(SD_SPI_BASE)->IFG &= ~(EUSCI_B_SPI_RECEIVE_INTERRUPT);
    // SPI_transmitData
    EUSCI_B_CMSIS(SD_SPI_BASE)->TXBUF = dat;

	// wait until trasmission complete
	while (!(EUSCI_B_CMSIS(SD_SPI_BASE)->IFG & EUSCI_B_SPI_RECEIVE_INTERRUPT) );

	RcvDat = EUSCI_B_CMSIS(SD_SPI_BASE)->RXBUF;
	//RcvDat++;
}


/*-----------------------------------------------------------------------*/
/* Receive a byte from MMC via SPI  (Platform dependent)                 */
/*-----------------------------------------------------------------------*/

static
BYTE rcvr_spi (void)
{
    /* Send a dummy. */

	// SPI_clearInterruptFlag
    EUSCI_B_CMSIS(SD_SPI_BASE)->IFG &= ~(EUSCI_B_SPI_RECEIVE_INTERRUPT);
	// wait until trasmission complete
	//while (!(EUSCI_B_CMSIS(SD_SPI_BASE)->IFG & EUSCI_B_SPI_TRANSMIT_INTERRUPT) );
    // SPI_transmitData
    EUSCI_B_CMSIS(SD_SPI_BASE)->TXBUF = 0xFF;

	// wait until trasmission complete
	while (!(EUSCI_B_CMSIS(SD_SPI_BASE)->IFG & EUSCI_B_SPI_RECEIVE_INTERRUPT) );

    return (BYTE) EUSCI_B_CMSIS(SD_SPI_BASE)->RXBUF;
}


static
void rcvr_spi_m (BYTE *dst)
{
    *dst = rcvr_spi();

}

/*-----------------------------------------------------------------------*/
/* Wait for card ready                                                   */
/*-----------------------------------------------------------------------*/

static
BYTE wait_ready (void)
{
    BYTE res;

    Timer2 = 50;    /* Wait for ready in timeout of 500ms */
    rcvr_spi();
    do {
        res = rcvr_spi();
    		//dly_us(10);	// EDIT tschalch
    } while ((res != 0xFF) && Timer2);

    return res;
}

// de-asserts the CS pin to the card
static
void DESELECT (void)
{
	GPIO_setOutputHighOnPin(SD_PORT_CS, SD_PIN_CS);
	//dly_us(1);
	rcvr_spi();
}

// asserts the CS pin to the card
static
BYTE SELECT (void)
{

	GPIO_setOutputLowOnPin(SD_PORT_CS, SD_PIN_CS);
	//dly_us(1);
	if (wait_ready() == 0xFF) return 1;		// EDIT tschalch
	DESELECT();				// failed		// EDIT tschalch
    return 0;								// EDIT tschalch
}

/*-----------------------------------------------------------------------*/
/* Send 80 or so clock transitions with CS and DI held high. This is     */
/* required after card power up to get it into SPI mode                  */
/*-----------------------------------------------------------------------*/
static
void send_initial_clock_train(void)
{
    unsigned int i;

    /* Ensure CS is held high. */
    DESELECT();

