ansgomez/batteryless-walking-speed-estimation/code/CCStudio/MSP432_CameraAcquisition_8bit/sd_diskio.c
        case GET_SECTOR_SIZE :    /* Get sectors on the disk (WORD) */
            *(WORD*)buff = 512;
            res = RES_OK;
            break;

        case CTRL_SYNC :    /* Make sure that data has been written */
            if (wait_ready() == 0xFF)
                res = RES_OK;
            break;

        case MMC_GET_CSD :    /* Receive CSD as a data block (16 bytes) */
            if (send_cmd(CMD9, 0) == 0        /* READ_CSD */
                && rcvr_datablock(ptr, 16))
                res = RES_OK;
            break;

        case MMC_GET_CID :    /* Receive CID as a data block (16 bytes) */
            if (send_cmd(CMD10, 0) == 0        /* READ_CID */
                && rcvr_datablock(ptr, 16))
                res = RES_OK;
            break;

        case MMC_GET_OCR :    /* Receive OCR as an R3 resp (4 bytes) */
            if (send_cmd(CMD58, 0) == 0) {    /* READ_OCR */
                for (n = 0; n < 4; n++)
                    *ptr++ = rcvr_spi();
                res = RES_OK;
            }

//        case MMC_GET_TYPE :    /* Get card type flags (1 byte) */
//            *ptr = CardType;
//            res = RES_OK;
//            break;

        default:
            res = RES_PARERR;
        }

        DESELECT();            /* CS = H */
        //rcvr_spi();            /* Idle (Release DO) */
    }
    return res;
}



/*-----------------------------------------------------------------------*/
/* Device Timer Interrupt Procedure  (Platform dependent)                */
/*-----------------------------------------------------------------------*/
/* This function must be called in period of 10ms                        */

void disk_timerproc (void)
{
    BYTE n;

    n = Timer1;                        /* 100Hz decrement timer */
    if (n) Timer1 = --n;
    n = Timer2;
    if (n) Timer2 = --n;
}

/*---------------------------------------------------------*/
/* User Provided Timer Function for FatFs module           */
/*---------------------------------------------------------*/
/* This is a real time clock service to be called from     */
/* FatFs module. Any valid time must be returned even if   */
/* the system does not support a real time clock.          */

DWORD get_fattime (void)
{

    return    ((2007UL-1980) << 25)    // Year = 2007
            | (6UL << 21)            // Month = June
            | (5UL << 16)            // Day = 5
            | (11U << 11)            // Hour = 11
            | (38U << 5)            // Min = 38
            | (0U >> 1)                // Sec = 0
            ;

}


/*
 * Initialize SPI connection to SD card
 */
void SDcard_SPI_init(void) {
	/* SPI Master Configuration Parameter */
	const eUSCI_SPI_MasterConfig spiMasterConfig =
	{
	        EUSCI_B_SPI_CLOCKSOURCE_SMCLK,             // SMCLK Clock Source
			CS_getSMCLK(),                             // SMCLK 3Mhz
			SD_SPI_FREQUENCY,                          // SPICLK = 500khz
	        EUSCI_B_SPI_MSB_FIRST,                     // MSB First
	        EUSCI_B_SPI_PHASE_DATA_CHANGED_ONFIRST_CAPTURED_ON_NEXT,    // Phase
	        EUSCI_B_SPI_CLOCKPOLARITY_INACTIVITY_HIGH, // High polarity
	        EUSCI_B_SPI_3PIN                           // 3Wire SPI Mode
	};

	/* Selecting P4.5 as output for Powering the SD Card. */
	GPIO_setAsPeripheralModuleFunctionInputPin(SD_PORT_POWER, SD_PIN_POWER, GPIO_PRIMARY_MODULE_FUNCTION);
	GPIO_setAsOutputPin(SD_PORT_POWER, SD_PIN_POWER);
	GPIO_setOutputHighOnPin(SD_PORT_POWER, SD_PIN_POWER);

	/* Selecting P1.5 P1.6 and P1.7 in SPI mode */
	GPIO_setAsPeripheralModuleFunctionInputPin(SD_PORT_CLK, SD_PIN_CLK, GPIO_PRIMARY_MODULE_FUNCTION);
	GPIO_setAsPeripheralModuleFunctionInputPin(SD_PORT_MISO, SD_PIN_MISO, GPIO_PRIMARY_MODULE_FUNCTION);
	GPIO_setAsPeripheralModuleFunctionInputPin(SD_PORT_MOSI, SD_PIN_MOSI, GPIO_PRIMARY_MODULE_FUNCTION);

	/* CS setup. */
	GPIO_setOutputHighOnPin(SD_PORT_CS, SD_PIN_CS);
	GPIO_setAsOutputPin(SD_PORT_CS, SD_PIN_CS);

	/* Configuring SPI in 3wire master mode */
	SPI_initMaster(SD_SPI_BASE, &spiMasterConfig);
	/* Enable SPI module */
	SPI_enableModule(SD_SPI_BASE);
}

void SDcard_enable() {
	/* Configure SysTick for a 100Hz interrupt.  The FatFs driver wants a 10 ms tick. */
	SysTick_setPeriod(CS_getSMCLK() / 100);
	SysTick_enableModule();
	SysTick_enableInterrupt();

	power_on();
}

void SDcard_disable() {
	/* Disable SysTick */
	SysTick_disableModule();
	SysTick_disableInterrupt();
	power_off();
}
